Revit 2026 API

# UIApplicationDoDragDrop(ICollectionString) Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void DoDragDrop(
	ICollection<string> dropData
)
```
```vb
Public Shared Sub DoDragDrop (
	dropData As ICollection(Of String)
)
```
```cpp
public:
static void DoDragDrop(
	ICollection<String^>^ dropData
)
```
```fsharp
static member DoDragDrop :
        dropData : ICollection<string> -> unit
```

#### Parameters

dropData ICollectionString

#### Reference

UIApplication Class

DoDragDrop Overload

Autodesk.Revit.UI Namespace